    # 1) ჩანაწერი ნახოთ ხელახლა, ამოიწეროთ კაჰუტის შეკითხვები და დეტალურად ახსნათ და განმარტოთ პასუხები, დაწეროთ კოდი და გატესტოთ ყველაფერი.

#კითხვა 1

#რა არის პითონი პროგრამირებაში.

#პითონი პროგრამირებაში არის პროგრამირების ენა.

#კითხვა 2

#რა არის turtle-ი python-ში?

#turtle-ი python-ში არის ბიბლიოთეკა/library

#კითხვა 3 

#რას გამოიტანს ეს კოდი ტერმინალში?

print('heloo World')

#ეს კოდი გამოიტანს heelo World-ს

#კითხვა 4 

#რას გამოიტანს ეს კოდი ტერმინალში?

print(True > False)

#ეს კოდი გამოიტანს True-ს, რადგან False შეესაბამება 0-ს, ხოლო True შეესაბამება 1-ს. 1 > 0.

#კითხვა 5 

#რითი ვქმნით კომენტარებს python-ში?

# #-ით

#კითხვა 6 

#რას გამოიტანს ეს კოდი ტერმინალში?

x = 15

y = 4

print(x // y)

#ეს კოდი გამოიტანს 3-ს, რადგან ასეთი გაყოფის ოპერატორს გამოაქვს შედეგი ნაშთისა და float-ის გარეშე.

#კითხვა 7

#რას გამოიტანს ეს კოდი ტერმინალში?

x = 10

y = 4

print(x / 4)

#ეს კოდი გამოიტანს 2.5-ს, რადგან ეს არის ჩვეულებრივი გაყოფის ოპერატორი.

#კითხვა 8 

#რას გამოიტანს ეს კოდი ტერმინალში?

x = 10

y = "20"

print(x + y)

#ეს კოდი გამოიტანს error-ს, რადგან ჩვენ არ შეგვიძლია სტრინგის და ინტეჯერის შეკრება.

#კითხვა 9 

x = 5

y = 2

print(x ** y)

#ეს არის ხარისხის ოპერატორი. მარტივად, რომ ვთქვათ, ეს იგივეა, რაც 5 ** 2. 5 ** 2 კი ნიშნავს 5-ი ხარისხად 2-ს, ანუ 5*5=25. კოდი დაპრინტავს 25-ს.

#კითხვა 10

#if მუშაობს else-ის გარეშე.

#ეს არის true, გამოცდილებიდან გამომდინარე :დ.

#კითხვა 11 

#რითი მთავრდება for loop?

#for loop-ის დასასრულებლად შეგვიძლია გამოვიყენოთ break ოპერატორი.

#კითხვა 12 

#რა იქნება 10 % 3?

# % არის ოპერატორი, რომელსაც გაყოფის შედეგად გამოაქვს ნაშთი, შესაბამისად ამ გაყოფის შედეგი იქნება 1.

#კითხვა 13 

#integer მრავლდება stringze.

#ეს არის true. ასეთი გამრავლების შედეგად დაიპრინტება იმდენი სტრინგი, რამდენსაც მივუთითებთ ინტეჯერს.

#კითხვა 14 

#რას გამოიტანს ეს კოდი ტერმინალში?

print(3 > 4 or 3 < 5 and 500 < 400 or 320 > 244)

#ეს კოდი ტერმინალში გამოიტანს True-ს. ორივე or ოპერატორის პასუხი არის True, შესაბამისად and ოპერატორისთვისაც გამოვა True.

#კითხვა 15

#რა არის list?

#პასუხია array(წყობა). (ჯერ არ გაგვივლია)

#კითხვა 16

#რა არის ალგორითმი?

#ალგორითმი არის მოქმედების ნაბიჯ-ნაბიჯ შესრულება <3. (არ არის, მეტი არჩევანი არ მქონდა :დდ) ალგორითმი არის მოქმედების შესრულების ინსტრუქცია ნაბიჯ-ნაბიჯ <3.

#კითხვა 17

#პითონი გველია თუ კუდი?

#პასუხი იყო კუდი, თუმცა ჩემი აზრით გველია :დდ.

#კითხვა 18 

#დავითი უსმენს როკის სტილის მუსიკას

#True-ა :დდ ნიკაც უსმენს.

#კითხვა 19

#ბატონი გაბრიელი არ უსმენს მამა პაპურ ქართულ მუსიკას.

#რას ჰკადრებთ ბატონ გაბრიელს?! false!

#კითხვა 20 

#გაკვეთილი ჩატარდა კანფეტივით

#True!

#კითხვა 21

#რომელი ხინკალი ჯობია?

#პასუხი იყო ფასანაურული, თუმცა მე მაინც ქუთაისურს ვიტყვი ;).




