# მომხმარებელს შემოატანინეთ რიცხვი, შემდეგ კი დაბეჭდეთ თქვენ ეს რიცხვი კენტია თუ ლუწი

number = int(input("Say random number: "))

if (number // 2) * 2 == number:    #"//" - ეს არის გაყოფის ოპერატორი, თუმცა "/" - სგან განსხვავებით მას არ შეუძლია float-ის დაბრუნება,
    print("Your number is even!")  # ამის ნაცვლად იგი ჩამოაშორებს ათწილადს არამთელ ნაწილს და გამოიტანს მთელ რიცხვს (არ მოამრგვალებს!).
                                
else:
    print("Your number is odd!")

    # ამის გაკეთება ასევე შეიძლება ნაშთიანი გაყოფის ოპერატორით, ანუ % ით.
    # ნაშთიანი გაყოფის ოპერატორი შედეგად დააბრუნებს იმას, რაც დარჩება ნაშთად.
    # == არის შედარების ოპერატორი, რომელიც მუშაობს boolean ცვლადებზე. შედარების შედეგად თუ მნივნელობები ტოლია იგი დააბრუნებს true-ს, სხვა შემთხვევაში false-ს.
    