#1) დაპრინტეთ 5 შედარება or ოპერატორით (მაგალითად: 5 > 6 or 10 < 11).

print(5 > 6 or 122 > 12)
print(77 > 12 or 12 < 56)
print(65 < 121 or 12 < 53)
print(66 > 67 or 14 > 12)
print(445 < 321 or 1152 < 921)

#2) დაპრინტეთ 5 შედარება and ოპერატორით (მაგალითად: 5 > 6 and 10 < 11).

print(5 > 1 and 63 < 21)
print(641 > 542 and 241 < 2121)
print(5124 > 6441 and 6612 < 612)
print(9000 > 2141 and 65 > 21)
print(5612 > 512 and 6631 < 612)

#3) შექმენით 2 ცვლადი რომლებშიც გამოიყენებთ შედარების ოპერატორებს (ერთში and ოპერატორს, მეორეში or ოპერატორს). ორივე ცვლადს გვერდზე მიუწერეთ კომენტარის სახით, თქვენი აზრით კოდის გაშვების შემდეგ ცვლადი True მნიშვნელობას მიიღებს თუ False'ს (ამას ისწავლით sololearn'ში და ქვემოთ ჩაგდებულ ფოტოში). მაგალითად, True and False მიიღებს False მნიშვნელობას ამიტომ მივუწერთ ასე: variable = True and False #False. შემდეგ კი ეს ორი კიდევ შეადარეთ ერთმანეთს print'ის მეშვეობით (რომელი ოპერატორითაც გინდათ).

variable1 = True and True #true
variable2 = False or False #false 

print(variable1 or variable2)
print(variable1 and variable2)

#4) შექმენით 2 ცვლადი, ამ ცვლადებში მომხმარებელს შემოატანინეთ 2 რიცხვი და შემდეგ შეადარეთ ისინი, and და or ოპერატორებით.

age = int(input("Say your age: "))
dad_age = int(input("Say your dad age: "))
print(age or dad_age)
print(age and dad_age)

#5) დაგჭირდებათ 3 ცვლადი. პირველში და მეორეში გააკეთეთ მათემატიკური შედარებები (მაგალითად: variable = 10 < 20). მესამე ცვლადში ეს ორი შეადარეთ ერთმანეთს, შემდეგ კი დაპრინტეთ ეს ცვლადი.

variable3 = 25 > 24
variable4 = 53 < 1
variable5 = variable3 == variable4
print(variable5)

#6) შექმენით 4 სხვადასხვა ტიპის ცვლადი, type() ფუნქციის მეშვეობით შეამოწმეთ მათი ტიპები და გამოიტანეთ ტერმინალში. 

car = "Audi"
price = 70000
rent = 700.0
i_want_car = True and True
print(type(car), type(price), type(rent), type(i_want_car))

#7) შექმენით ორი ცვლადი სადაც მომხმარებელს input'ის მეშვეობით შემოატანინებთ თავის სახელს და GOA'ს ჯგუფის ნომერს რომელშიცაა. ამ ცვლადების გამოყენებით დაპრინტეთ მისალმება: Hello 'მომხმარებლის სახელი'. Welcome to Group 'მისი ჯგუფის ნომერი'.
name = input("Say your name: ")
group = input("Say your group in GOA: ")
print("Hello " + name + ". " + "Welcome To Group " + group + ".")

#8) შექმენით ცვლადი სადაც ერთ რიცხვს გაყოფთ მეორეზე. დაპრინტეთ თვითონ ეს ცვლადი და ასევე მისი ტიპი. შემდეგ კი კარგად დააკვირდით რა მოხდა, გააანალიზეთ და დაიმახსოვრეთ.

variable6 = 27 / 9 
print(variable6, type(variable6))

#9) შექმენით ორი integer ტიპის ცვლადი: num1 და num2. მიეცით მათ მნიშვნელობები: 20 და 24. შემდეგ მათი მეშვეობით ტერმინალში გამოიტანეთ 2024.

num1 = 20
num2 = 24
print(str(num1) + str(num2))

#10) შექმენით 5 float ტიპის ცვლადი (ათწილადები). შემდეგ კი დაპრინტეთ ხუთივე და დაპრინტვის დროს ყველა მათგანი გარდაქმენით integer'ად. (დააკვირდით იმას რომ float'ის integer'ად გარდაქმნა კი არ ამრგვალებს რიცხვს, არამედ წერტილს და მის მარჯვნივ მყოფ ციფრებს აშორებს).
number1 = 24.1
number2 = 325.21
number3 = 532.6
number4 = 213.3
number5 = 621.2

print(int(number1), int(number2), int(number3), int(number4), int(number5))