# კაჰუტი რაც გავაკეთეთ ამ კაჰუტზე ივარჯიშეთ, ჩნააწერი ნახეთ ხელახლა, 
# ამოიწერეთ ყველა კითხვა და დეტალურად ახსენით კომენტარის სახით პასუხი.

#კითხვა 1 

#რას დაგვიბეჭდავს ეს კოდი ტერმინალში? print(type("Hello, World!"))

#ამ კოდის მიხედვით, ჩვენ print ფუნქციას გადავცემთ type ფუნქციას, რომლის მოვალეობაც მონაცემთა ტიპის დაბრუნება. აქედან გამომდინარე ტერმინალში დაიბეჭდება class str.

#კითხვა 2 

#როგორ შევქმნათ პითონში კომენტარი?

#ამისთვის გამოიყენება # სიმბოლო.

#კითხვა 3 

#რისთვის ვიყენებთ range() ფუნქციას?

#range ფუნქცია გამოიყენება რიცხვების დიაპაზონის შესაქმნელად, თანმიმდევრობის დაცვით.

#კითხვა 4 

#სტრინგების კონკატინაციისთვის რომელ ოპერატორს ვიყენებთ?

#სტრინგების კონკატინაციისთვის ვიყენებთ "+" ოპერატორს.

#კითხვა 5 

#ამ 4-დან, რომელი არ არის სწორი მონაცემთა ტიპი?

#სწორი მონაცემთა ტიპი არ არის "real"

#კითხვა 6

#რომელი ფუნქციის გამოყენებით შეგვიძლია შემოვატანინოთ მომხმარებელს ინფორმაცია?

#მომხმარებელისთვის ინფორმაციის შემოსატანად შეგვიძლია გამოვიყენოთ type ფუნქცია.

#კითხვა 7 

#რომელი სიტყვით (keyword) შეიქმნება ციკლი?

#ციკლის შექმნა მოხდება for keyword-ით.

#კითხვა 8

#რომელი ფუნქციით გადავაქცევთ ტექსტურ ინფორმაციას ათწილადად?

#float() ფუნქციით.

#კითხვა 9

#რას დაბეჭდავს ეს კოდი? print(2 > 3)

#ეს კოდი დაბეჭდავს False-ს.

#კითხვა 10

#რომელი კოდით შევქმნით უსასრულო ციკლს?

#while true:

#კითხვა 10

#რას დაგვიბეჭდავს ეს კოდი? print("Hello " + "World")

#კოდი დაბეჭდავს Hello World-ს.

#კითხვა 11

#რას დაგვიბეჭდავს ეს კოდი? print(4 % 2)

#ეს კოდი დაგვიბეჭდავს 0-ს, რადგან %-ი არის გაყოფის ოპერატორი, რომელიც აბრუნებს განაყოფის შედეგად დარჩენილ ნაშთს. 4-ის 2-ზე გაყოფის შედეგად ნაშთი 0-ია.

#კითხვა 12 

#რომელია პითონის ფაილის სწორი დაბოლოება?

#სწორი დაბოლოებაა .py

#კითხვა 13 

#რას დაგვიბეჭდავს ეს კოდი? print(10 == 10)

#ეს კოდი დაგვიბეჭდავს True-ს, რადგან "==" არის შედარებოს ოპერატორი.

#კითხვა 14 

#ამ 4-დან, რომელია სწორი ცვლადის სახელი?

# _var_name

#კითხვა 15

#რას დაგვიბეჭდავს ეს კოდი? print("5" * 3)

#ეს კოდი დაგვიბეჭდავს 555-ს, რადგან 5 სტრინგის სახითაა მოცემული, როცა მას ვამრავლებთ ინტეჯერზე მრავლდება მხოლოდ სიმბოლოები.

#კითხვა 16

#რას დაგვიბეჭდავს ეს კოდი: print("Hello"[-1])

#ეს კოდი დაგვიბეჭდავს o-ს.

#კითხვა 17

#რას დაგვიბეჭდავს ეს კოდი? print(list(range(2, 10, 2)))

#ჩვენ პრინტ ფუნქციას გადავეცით სია, რომელშიც range ფუნქციის დახმარებით ვბეჭდავთ 2-დან 10-მდე ყოველ მეორე ციფრს.

#კითხვა 18

#რისთვის ვიყენებთ while ციკლს?

#იმისთვის, რომ კოდი განმეორდეს მაშინ, როდესაც while ციკლში მოცემული პირობა იქნება სწორი.

#კითხვა 19

#ამ 4-დან რომელი წინადადებაა სწორი while ციკლების შესახებ?

#ამ ოთხიდან მხოლოდ სწორია პირობა "while ციკლი შესაძლოა უსასრულოდ გაგრძელდეს, თუ მისი პირობა სწორი იქნება".

#კითხვა 20

#boolean მონაცემთა ტიპის შესაძლო მნიშვნელობებია:

#True და False.

#გადამეღალა ხელები, მერე გავაგრძელებ (50 კითხვაა სულ).