# თუ ასაკი მეტი იქნება 18 - ზე, შესრულდეს რაღაც მოქმედება. - ამას ეწოდება პირობა.
# if - თუ
age = int(input("Enter your age: "))
if age > 18: #ამას ეწოდება if პირობა. ამ ორწერთილის შემდეგ უნდა შესრულდეს რაღაც მოქმედება.
    print("სრულსწლოვანი ხარ")         # ინდენტაციის მიხედვით, ეს მოქმედება უნდა მოხდეს შემდეგ ხაზზე ოთხი სპეისით შიგნით,
                                    # წინააღმდეგ შემთხვევაში if ფუნქცია print ფუნქციასთან კავშირს დაკარგავს.
# if 69 < 18:
#     print("არასრულწლოვანი ხარ")

#age - ს შედარება 18 თან აუცილებლად დააბრუნებს boolean მნიშვნელობას.

#if age < 18:
    #print("არასრულწლოვანი ხარ")
    
    #კომენტარში მოცემული კოდის შესრულება შეიძლება სხვაგვარადაც.

else: 
    print("არასრულწლოვანი ხარ") #ფუნქცია else ნიშნავს "სხვა შემთხვევაში".

    #საკლასო დავალება: მომხმარებელს შემოატანინეთ 1-დან 100-მდე ქულა, თუ ქულა იქნება 80-ზე მეტი დაბეჭდეთ, 
    #რომ კარგი შედეგია და შეაქეთ, სხვა შემთხვევაში დაბეჭდეთ, რომ ძალიან ცუდი შედეგია და უნდა გააუმჯობესოს.

# score = int(input("Enter your test result: "))

# if score > 80:
#     print("Exellent work! Bravo!")
# else:
#     print("So bad result, get it better!")

    #if ფუნქციის გამოყენება else ფუნქციამდე რეკომენდირებულია ერთხელ. თუ გვჭირდება რამდენიმე პირობა,
    #შეგვიძლია გამოვიყენოთ else-სა და if-ფუნქციის გაერთიანება - elif. რომ შევაჯამოთ, elif არის if-სა და else-ს შორის დამატებითი პირობა.
    #გაითვალისწინე, რომ elif პირობა/ფუნქცია აუცილებლად თავსდება if-სა და else-ს შორის.

    score = int(input("Enter your test result: "))

if score > 80:
    print("Exellent work! Bravo!")

elif score > 70:
    print("Not Bad!")

elif score == 50:
    print("Half, work more")

else:
    print("bad result, get it better!")

    #საკლასო დავალება: მომხმარებელს უნდა შემოატანინოთ რომელ ჯგუფში სწავლობს, თუ ჯგუფის დასახელება იქნება ჯგუფი 19 დაბეჭდოს,
    #რომ მისი მენტორი არის გაბრიელი, თუ ჯგუფის დასახელება იქნება 20 დაბეჭდოს,
    #რომ მისი მენტორი არის ლუკა, თუ ჯგუფის დასახელება იქნება 21 დაბეჭდოს, რომ მისი მენტორი არის დავითი,
    #ხოლო ყველა სხვა შემთხვევაში დაბეჭდოს, რომ მისი მენტორი არის ნიკა.

goa_group = int(input("Say your group in GOA: "))

if goa_group == 19:
    print("Your group mentor is Gabrieli")

elif goa_group == 20:
    print("Your group mentor is Luka")

elif goa_group == 21:
    print("Your group mentor is Daviti")

else:
    print("Your group mentor is Nika")


    #პროგრამირებაში გამოიყენება სამი ძირითადი ტექნიკა, რომელიც ხელს უწყობს ინსტრუქციების ნაკადის მართვას.
       #  (control the flow of instructions )
       #ესენია: მიმდევრობა(Sequences): ინსტრუქციების მიმდევრობით, ზემოდან ქვემოთ შესრულება, 
       #ციკლები(Iterations): ციკლები კოდს რამდენჯერმე განმეორების საშუალებას აძლევს, 
       #შერჩევითი(Selections): ეს არის გადაწყვეტილების მიღების პროცესი, ასეთ დროს კომპიუტერს რაღაც პირობის მიხედვით ვაძლევთ არჩევანს.
    #ალგორითმი რაიმეს ნაბიჯ-ნაბიჯ შესრულების ინსტრუქციაა.
       #ალგორითმი ბევრი რამით შეიძლება გამოისახოს, მაგალითად როგორიცაა flowcharts(სქემები).

    #სხვა გზა, რომ ალგორითმი წარმოვადგინოთ არის Pseudocode - ფსევდოკოდი. მარტივად,
      #რომ ვთქვათ ფსევდოკოდი ახლოსაა პროგრამირების ენასთან და იგი განკუთვნილია ყველა პროგრამირების ენისათვის.

