# პითონში შეგვიძლია სიების შექმნაც. list არის მონაცემთა სტრუქტურა, რომელიც გამოიყენება ელემენტების დასამახსოვრებლად და
# მათზე ოპერაციების შესასრულებლად. მასში შეგვიძლია შევინახოთ სხვადასხვა ტიპის მონაცემები.
my_list = [1, 2, 3, 4, 5]#list ში შენახულ ელემენტებს მნიშვნელობები ეწოდებათ.
mixed_list = [1, "hello", 3.14, True] #თითოეულ მნიშვნელობას აქვს თავისი ინდექსი, რომელიც ძირითადად მის რიგის ნომერს შეესაბამება. 
print(my_list, mixed_list) #მაგალითად აქ hello-ს ინდექსი იქნება 1. გავითვალისწინოთ, რომ ინდექსების ათვლა იწყება 0 - დან.

#ასევე ჩვენ შეგვიძლია შევქმნათ ცარიელი ლისთი და მასში append() ფუნქციის საშუალებით დავამატოთ მნიშვნელობები.

list = []
list.append([1, 2, 3, 4])
print(list)

#შესაძლებელია ლისთების გაერთიანებაც. ამისთვის საჭიროა extend() ფუნქცია.

list1 = [1, 3, 7, 9]
list2 = [2, 4, 6, 8]
list1.extend(list2)
print(list1)

#ასევე შესაძლებელია ლისთიდან ნებისმიერი ელემენტის ამოღება ფუნქცია remove()-ს დახმარებით.

fruits = ["apple", "banana", "grape"]
fruits.remove("apple")
print(fruits)

#როგორც შეგვიძლია ლისთიდან ნებისმიერი ელემენტის ამოღება, ასევე შეგვიძლია ჩასმაც insert() ფუნქციის დახმარებით.

cars = ["Audi RS6", "Nissan GTR", "Nissan Silvia S14"]
cars.insert(0, "Dodge Charger") #ინსერთ ფუნქციაში პირველად აუცილებლად ეწერება ინდექსი, შემდეგ კი ელემენტი, რისი ჩამატებაც გვინდა.
print(cars)