#Codewars solutions!

# 1)
def no_space(x): #ჩვენი დავალებაა სტრინგიდან სპეისების მოშორება.
    reversed_string = "" #აქ ვქმნი ცვლადს, რომელშიც მოგვიანებით მოექცევა უსფეისო, შემობრუნებული სტრინგი.
    string_spaces = "" #აქ ვქმნი ცვლადს, რომელშიც მოვათავსებ სტრინგის ზედმეტ სპეისებს.
    count = 0 #აქ ვქმნი count ცვლადს, რომელსაც ვუტოლებ 0-ს.
    for i in range(len(x)): #აქ ვქმნი ციკლს, რომელიც მეორდება იმდენჯერ, რამდენიც არის მოცემული სტრინგის სიგრძე.
        count = count - 1
        if x[count] == " ": #აქ ვიყენებ ზემოთ აღნიშნულ ცვლადს. იგი მანამ შეცვლის სტრინგის ინდექსს, სანამ მისი სიგრძე არ ამოიწურება.
            string_spaces = string_spaces + x[count]  #ამ ცვლადში ვინახავ ზემოთხსენებული სტრინგის სპეისებს.
        else:
            reversed_string = reversed_string + x[count] #ამ ცვლადში ვინახავ სტრინგის ნებისმიერ სიმბოლოს სპეისის გარდა. იგი შეინახება შემობრუნებულად.
        string = "" #აქ უკვე ვქმნი string ცვლადს, რომელშიც შეინახება s სტრინგის ყველა სიმბოლო დალაგებულად, სფეისის გარდა.
        length = len(reversed_string)  #აქ ვქმნი ცვლადს, რომელსაც ვუტოლებ სფეისების გარეშე მყოფ შემობრუნებული ცვლადის სიგრძეს.
        while length > 0: #აქ ვქმნი ციკლს, რომელიც იბრუნებს მანამ, სანამ length ცვლადი არ გაუტოლდება 0-ს
            length = length - 1
            string = string + reversed_string[length] #აქ კი უკვე string ცვლადში ვსვავ სტრინგს სფეისების გარეშე დალაგებულად.

# 2)
def greet(name):
    return "Hello, " + name + " how are you doing today?"

# 3)

def century(year):
    return (year + 99) // 100

