# for loop ების გარდა გვაქვს while loop - ებიც. თუ for loop-ების შემთხვევაში ვიცით რამდენჯერ 
# შესრულდება ესა თუ ის მოქმედება, while loop - ების შემთხვევაში ამას სულ ვერ განვსაზღვრავთ.
# ზოგადად სიტყვა while ნიშნავს "სანამ".

lives = 20
while lives > 0:
    print("lives are more than 0")

#რომ "გადავთარგმნოთ" ეს კოდი, ჩვენ while ფუნქციას ვეუბნებით,
#  რომ მანამ გააგრძელოს "lives are more than 0" - ის დაპრინტვა, სანამ lives ცვლადი მეტია 0-ზე.

# შეგვიძლია lives ცვლადს ყოველ დაპრინტვაზე გამოვაკლოთ 1

lives = 20
while lives > 0:
    print("lives are more than 0")
    lives = lives - 1 

#შექმენით ცვლადი, რომელიც უდრის 20-ს და მანამდე დაპრინტეთ "goa", 
#სანამ ცვლადი 0-ს არ გაუტოლდება, ეცადეთ თავიდან აირიდოთ უსასრულო ლუპი.

goa = 20

while goa > 0:
    print("goa")
    goa = goa - 1 

    #შექმენით ცვლადი, რომელიც უდრის 0-ს და მანამდე დაპრინტეთ "hello world",
    #სანამ ცვლადი 10-ს არ გაუტოლდება, თავიდან აირიდეთ უსასრულო ლუპი.

hello = 0

while hello < 10:
    print("hello world")
    hello = hello + 1 

    #შეგვიძლია გამოვიყენოთ ასეთი ოპერატორიც <=, ან ასეთი >=, ეს უკანასკნელი ნიშნავს "მეტია ან ტოლია".
    #ასევე გვაქვს != ოპერატორიც, რომელიც ნიშნავს "არ უდრის".
    


    